[
  {
    "type": "seminar",
    "title": "Generative AI for Science",
    "speaker": "Greg Durrett",
    "affiliation": "UT Austin Computer Science",
    "link": "https://cam-ac-uk.zoom.us/j/97599459216?pwd=QTRsOWZCOXRTREVnbTJBdXVpOXFvdz09",
    "venue": "online",
    "place": "",
    "date": "Thursday, 6 June 2024",
    "time": "3 pm - 4 pm",
    "abstract" : "This talk will explore how we can develop and use generative AI to help researchers and clinicians. I will first discuss how LLMs can act as research co-advisors. Then I will present Dragonfly, our new architecture for large visual-language model that leverages multi-resolution Zoom to achieve state-of-the-art performance across several medical tasks. Finally, I will explore the role of language as the foundational data modality for science.",
    "bio" : "James Zou is an associate professor of Biomedical Data Science, CS, and EE at Stanford University. He is also the faculty director of Stanford AI4Health. He works on improving the foundations of ML by making models more trustworthy and reliable, as well as in-depth scientific and clinical applications. Many of his innovations are widely used in tech and biotech industries.  He has received a Sloan Fellowship, an NSF CAREER Award, two Chan-Zuckerberg Investigator Awards, a Top Ten Clinical Achievement Award, several best paper awards, and faculty awards from Google, Amazon, Tencent, and Adobe. His research has also been profiled in popular press, including the NY Times, WSJ, and WIRED."
  },
  {
    "type": "seminar",
    "title": "Generative AI for Science",
    "speaker": "James Zou",
    "affiliation": "Stanford University",
    "link": "https://cam-ac-uk.zoom.us/j/97599459216?pwd=QTRsOWZCOXRTREVnbTJBdXVpOXFvdz09",
    "venue": "online",
    "place": "",
    "date": "Thursday, 6 June 2024",
    "time": "3 pm - 4 pm",
    "abstract" : "This talk will explore how we can develop and use generative AI to help researchers and clinicians. I will first discuss how LLMs can act as research co-advisors. Then I will present Dragonfly, our new architecture for large visual-language model that leverages multi-resolution Zoom to achieve state-of-the-art performance across several medical tasks. Finally, I will explore the role of language as the foundational data modality for science.",
    "bio" : "James Zou is an associate professor of Biomedical Data Science, CS, and EE at Stanford University. He is also the faculty director of Stanford AI4Health. He works on improving the foundations of ML by making models more trustworthy and reliable, as well as in-depth scientific and clinical applications. Many of his innovations are widely used in tech and biotech industries.  He has received a Sloan Fellowship, an NSF CAREER Award, two Chan-Zuckerberg Investigator Awards, a Top Ten Clinical Achievement Award, several best paper awards, and faculty awards from Google, Amazon, Tencent, and Adobe. His research has also been profiled in popular press, including the NY Times, WSJ, and WIRED."
  },
  {
    "type": "seminar",
    "title": "Practical and Specialised NLP Solutions: The Case of Social Media",
    "speaker": "Jose Camacho-Collados",
    "affiliation": "Cardiff University.",
    "link": "https://cam-ac-uk.zoom.us/j/97599459216?pwd=QTRsOWZCOXRTREVnbTJBdXVpOXFvdz09",
    "venue": "hybrid",
    "place": "Room SR-24 in the English Faculty Building",
    "date": "Thursday, 30 May 2024",
    "time": "3 pm - 4 pm",
    "abstract" : "Large generative language models (LLMs) are currently ubiquitous in NLP research. However, when it comes to specific applications, these powerful models are often impractical and not always the optimal choice, and there may be more adequate solutions for specific problems. In this talk, I will advocate for practical and effective solutions in NLP. I will try to revisit the importance of high-quality data (including labelled data) and reliable evaluation benchmarks in the current LLM landscape. Using social media as a case study, I will explain some of the challenges arising from processing content in these platforms. The multilingual, dynamic, informal and multimodal nature of social media, as well as the constant influx of new content, means that standard techniques are seldom optimal, and specialised models are often required.",
    "bio" : "Jose Camacho-Collados is a Professor at Cardiff University, leading the Cardiff NLP group. Before joining Cardiff University, he completed his PhD in Sapienza University of Rome and was a Google AI PhD Fellow. Until recently, his research has focused on various semantics aspects in NLP with a distributional perspective. He wrote the “Embeddings in Natural Language Processing\" book and is the General Chair of *SEM 2024. More related to the topic of the talk, in the last few years Jose has been working in social media analysis and applications, developing NLP tools specifically targeted to this domain."
  }
]